perf/plain-x-request.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 1
      arrivalCount: 1000
    - name: Zero
      duration: 10
      arrivalRate: 0

    

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'